#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ДобавитьТестовыйНабор("Функции работы с почтой").ВТранзакции()
		.ДобавитьТест("СоздатьИнтернетПочтовоеСообщение", "СоздатьИнтернетПочтовоеСообщение: корректное создание интернет почтового сообщения", "Позитив")
		.ДобавитьТест("ОтправитьПисьмо", "ОтправитьПисьмо: генерируем письмо и отправляем с мокированием", "Позитив")	
	;
	
КонецПроцедуры

Процедура СоздатьИнтернетПочтовоеСообщение() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	// - Создание Справочник.ИсходящиеПисьма
	ИсходящееПисьмоСсылка = СозданиеИсходящегоПисьма();
	
	Отправитель = "";
	Профиль = РаботаСПочтой.ПолучитьПрофиль(Отправитель);
		
	// 2. Выполнение функции.
	РезультатФункции = РаботаСПочтой.СоздатьИнтернетПочтовоеСообщение(ИсходящееПисьмоСсылка, Отправитель);
	
	// 3. Проверка результата.
	ЮТест.ОжидаетЧто(РезультатФункции)
		.ИмеетТип("ИнтернетПочтовоеСообщение")
		.Свойство("Получатели")
			.ИмеетДлину(2)
		.Свойство("Тема")
			.Равно(ИсходящееПисьмоСсылка.Наименование)
		;
	
КонецПроцедуры

Процедура ОтправитьПисьмо() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.

	// - Создание Справочник.ИсходящиеПисьма
	ИсходящееПисьмоСсылка = СозданиеИсходящегоПисьма();
	
	// - Мокирование ОтправитьПисьмоПоИнтернетПочте
	Мокито.Обучение(РаботаСПочтой)
		.Когда("ОтправитьПисьмоПоИнтернетПочте").Вернуть(Истина)
		.Прогон();	
	
	// 2. Выполнение функции.
	РезультатФункции = РаботаСПочтой.ОтправитьПисьмо(ИсходящееПисьмоСсылка);
	
	// 3. Проверка результата.
	ЮТест.ОжидаетЧто(РезультатФункции)
		.ИмеетТип("Булево")
		.ЭтоИстина()
		;
	
	// см. пример проверки наличия данных по записанным данным https://bia-technologies.github.io/yaxunit/docs/features/auxiliary-modules/queries	
	ДанныеЗаписи = ЮТЗапросы.Запись("РегистрСведений.СостояниеИсходящихПисем",
    	ЮТест.Предикат()
        	.Реквизит("Письмо").Равно(ИсходящееПисьмоСсылка));
			
	ЮТест.ОжидаетЧто(ДанныеЗаписи)
		.ИмеетТип("Структура")
		.Свойство("Отправлено").ЭтоИстина()
		;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СозданиеИсходящегоПисьма()
	
	ТекстСодержимого = НСтр("ru = 'Добрый день!
		| 
		|Просьба рассмотреть возможность поставки молока (3,2% жирности) в количестве 100 (ста) пакетов в адрес нашей компании.
		| 
		|Желательный срок поставки: 10 дней.
		| 
		|По возможности просьба ответить оперативно.
		| 
		|С уважением,
		|Генеральный директор Федоров М.А. 
		|
		|'"); 
	
	Содержимое = СтрокаВХранилищеСФорматированнымДокументом(ТекстСодержимого);
	
	ИсходящееПисьмоСсылка = ЮТест.Данные().КонструкторОбъекта("Справочник.ИсходящиеПисьма")
		.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля
		.Установить("Дата", Дата("26.11.2022 0:30:38")) 
		.Установить("Содержимое", Содержимое) 
		.Установить("Текст", ТекстСодержимого)
		.Установить("Получатель", НСтр("ru = 'givotnovodstvo@mail.ru; korovin@myasnoya.ru'"))
		.ТабличнаяЧасть("Получатели")
			.ДобавитьСтроку()
				.Установить("ЭлектроннаяПочта", НСтр("ru = 'givotnovodstvo@mail.ru'")) 
			.ДобавитьСтроку()
				.Установить("ЭлектроннаяПочта", НСтр("ru = 'korovin@myasnoya.ru'"))
		.Записать()
	;

	
	Возврат ИсходящееПисьмоСсылка;

КонецФункции

Функция СтрокаВХранилищеСФорматированнымДокументом(Текст)

	ТекстФорматированный = Новый ФорматированнаяСтрока(Текст);	

	ФорматированныйДокумент = Новый ФорматированныйДокумент;
	ФорматированныйДокумент.УстановитьФорматированнуюСтроку(ТекстФорматированный);
	
	Содержимое = Новый ХранилищеЗначения(ФорматированныйДокумент, Новый СжатиеДанных());
	
	Возврат Содержимое;

КонецФункции

#КонецОбласти
